W4D1/cats/app/controllers/cats_controller.rb

	def index
		# GET /cats
		# render json: Cat.all  #show all the cats
		@cats = Cat.all
---
SELECT "cats".* FROM "cats"

	def show
		# GET /cats/123
		# render json: Cat.find(params[:id]) #show the cat for that ID
		@cat = Cat.find(params[:id])
---
SELECT  "cats".* FROM "cats" WHERE "cats"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]

	def create
		@cat = Cat.new(cat_params)

		if @cat.save
---
INSERT INTO "cats" ("name", "created_at", "updated_at", "skill") VALUES (?, ?, ?, ?)  [["name", "Earl"], ["created_at", "2019-01-28 02:26:15.892081"], ["updated_at", "2019-01-28 02:26:15.892081"], ["skill", "Jumper"]]

	def update
		@cat = Cat.find(params[:id])
		if @cat.update(cat_params)
---
SELECT  "cats".* FROM "cats" WHERE "cats"."id" = ? LIMIT ?  [["id", 12], ["LIMIT", 1]]
UPDATE "cats" SET "skill" = ?, "updated_at" = ? WHERE "cats"."id" = ?  [["skill", "Meow"], ["updated_at", "2019-01-28 03:06:43.295967"], ["id", 12]]

	def edit
		# /cats/:id/edit
		# show a form to edit an existing object
		@cat = Cat.find(params[:id])
---
SELECT  "cats".* FROM "cats" WHERE "cats"."id" = ? LIMIT ?  [["id", 12], ["LIMIT", 1]]

	def destroy
		# DELETE /cats/:id
		cat = Cat.find(params[:id])
		cat.destroy
---
SELECT  "cats".* FROM "cats" WHERE "cats"."id" = ? LIMIT ?  [["id", 8], ["LIMIT", 1]]
DELETE FROM "cats" WHERE "cats"."id" = ?  [["id", 8]]