W4D1/cats/app/controllers/toys_controller.rb

    def index
        # /cats/:cat_id/toys
        cat = Cat.find(params[:cat_id])
---
SELECT  "cats".* FROM "cats" WHERE "cats"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]

    def show
        # /cats/:cat_id/toys/:id    ==> redundant
        # /toys/:id                 ==> preferable, since you already need the toy_id
        render json: Toy.find(params[:id])
---
SELECT  "toys".* FROM "toys" WHERE "toys"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]

    def create
        # POST /cats/:cat_id/toys
        # POST /toys
        @toy = Toy.new(toy_params)
        @cat = @toy.cat
        # toy.cat_id = params[:cat_id]

        if @toy.save
---
INSERT INTO "toys" ("cat_id", "name", "ttype", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["cat_id", 13], ["name", "Long String"], ["ttype", "string"], ["created_at", "2019-01-28 02:47:54.060452"], ["updated_at", "2019-01-28 02:47:54.060452"]]

    def destoy
        # /toys/:id
        toy = Toy.find(params[:id])
---
SELECT  "toys".* FROM "toys" WHERE "toys"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]

    def update
        # /toys/:id
         toy = Toy.find(params[:id])

         success = toy.update(toy_params)
---
SELECT  "toys".* FROM "toys" WHERE "toys"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
UPDATE "toys" SET "name" = ?, "updated_at" = ? WHERE "toys"."id" = ?  [["name", "string ball"], ["updated_at", "2019-01-27 23:51:22.575255"], ["id", 2]]

    def new
        @cat = Cat.find(params[:cat_id])
---
SELECT  "cats".* FROM "cats" WHERE "cats"."id" = ? LIMIT ?  [["id", 12], ["LIMIT", 1]]