W4D2/library/app/controllers/books_controller.rb

INSERT INTO "books" ("title", "author", "year", "category", "description", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7) RETURNING "id"
---
    def create
        # render json: "Creating book"
        @book = Book.new(book_params)

        if @book.save

SELECT  "books".* FROM "books" WHERE "books"."id" = $1 LIMIT $2  [["id", 5], ["LIMIT", 1]]
---
    def edit
        @book = Book.find_by(id: params[:id])

SELECT  "books".* FROM "books" WHERE "books"."id" = $1 LIMIT $2  [["id", 5], ["LIMIT", 1]]
UPDATE "books" SET "title" = $1, "updated_at" = $2 WHERE "books"."id" = $3  [["title", "Harry Potter 3000"], ["updated_at", "2019-01-28 21:46:59.596321"], ["id", 5]]
---
    def update
        @book = Book.find_by(id: params[:id])

        if @book.update_attributes(book_params)