W4D1/cats/app/views/cats/show.html.erb

SELECT "toys".* FROM "toys" WHERE "toys"."cat_id" = ?  [["cat_id", 12]]
---
<ul>
    <% @cat.toys.each do |toy| %>